//
// Copyright (c) 2016, Ryuta Miki All Rights Reserved.
//
// Licensed under the Apache License, Version 2.0 (the "License");
// you may not use this file except in compliance with the License.
// You may obtain a copy of the License at
//
//      http://www.apache.org/licenses/LICENSE-2.0
//
// Unless required by applicable law or agreed to in writing, software
// distributed under the License is distributed on an "AS IS" BASIS,
// WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
// See the License for the specific language governing permissions and
// limitations under the License.
//

# \u81ea\u52d5\u30b3\u30df\u30c3\u30c8(true:\u66f4\u65b0\u5f8c\u3001commit\u3057\u307e\u3059\u3002 false:commit\u30e1\u30bd\u30c3\u30c9\u3092\u547c\u3070\u306a\u3044\u9650\u308acommit\u3057\u307e\u305b\u3093
isAutoCommit=true

#DB
db.driver=org.postgresql.Driver
db.url=jdbc:postgresql://localhost:5432/Laube
db.user=postgres
db.password=postgres

# message list
N0001=The process was finished successfully.

// \u5165\u529b\u5024\u30a8\u30e9\u30fc\u7cfb
E0001=Parameter is null. Please ensure that it is properly set.(\u30d1\u30e9\u30e1\u30fc\u30bf\u304cnull\u3067\u3059\u3002\u305d\u308c\u304c\u9069\u5207\u306b\u8a2d\u5b9a\u3055\u308c\u3066\u3044\u308b\u3053\u3068\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002)
E0002=[Individual route] can not be specified. Please check.([\u500b\u5225\u30eb\u30fc\u30c8]\u3092\u6307\u5b9a\u3059\u308b\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093\u3002\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002)
E0003=This application required a [individual route]. Please specify an [individual route].(\u3053\u306e\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u306f\u3001\u500b\u5225\u30eb\u30fc\u30c8\u304c\u5fc5\u8981\u3067\u3059\u3002\u500b\u3005\u306e\u30eb\u30fc\u30c8\u3092\u6307\u5b9a\u3057\u3066\u304f\u3060\u3055\u3044\u3002)
E0004=[Individual route] and [Common Route] is not set of both. Please Set.(\u500b\u5225\u30eb\u30fc\u30c8\u3068\u5171\u901a\u30eb\u30fc\u30c8\u5171\u306b\u8a2d\u5b9a\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002 \u30bb\u30c3\u30c8\u3057\u3066\u304f\u3060\u3055\u3044\u3002)
E0005=There is an error in the setting of the function.(\u6a5f\u80fd\u306e\u8a2d\u5b9a\u306b\u8aa4\u308a\u304c\u3042\u308a\u307e\u3059\u3002)
E0006=Check the state.(\u72b6\u614b\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002)
E0007=Route information can not be found necessary for the application. please check.(\u30eb\u30fc\u30c8\u60c5\u5831\u306f\u3001\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u306b\u5fc5\u8981\u306a\u898b\u3064\u3051\u308b\u3053\u3068\u304c\u3067\u304d\u307e\u305b\u3093\u3002 \u30c1\u30a7\u30c3\u30af\u3057\u3066\u304f\u3060\u3055\u3044\u3002)
E0008=[Individual route] can not be found.(\u500b\u5225\u30eb\u30fc\u30c8\u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3002)
E0009=There is a conflict in the root set.(\u30eb\u30fc\u30c8\u8a2d\u5b9a\u306b\u77db\u76fe\u304c\u3042\u308a\u307e\u3059\u3002)
E0010=Application form other than the draft can not be updated.(\u4e0b\u66f8\u304d\u4ee5\u5916\u306e\u7533\u8acb\u66f8\u306f\u66f4\u65b0\u3067\u304d\u307e\u305b\u3093\u3002)

// DB\u30a8\u30e9\u30fc\u7cfb
E1001=The corresponding record in the application form master was not found.(\u7533\u8fbc\u66f8\u30de\u30b9\u30bf\u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3002\u30de\u30b9\u30bf\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002)
E1002=Application form can not be found. Make sure the application form master.(\u7533\u8fbc\u66f8\u30de\u30b9\u30bf\u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3002\u30de\u30b9\u30bf\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002)
E1003=no data.
E1004=because the same boss has appeared twice, to exit from the loop.(\u540c\u3058\u4e0a\u53f8\u304c\u4e8c\u56de\u767b\u5834\u3057\u3066\u3044\u308b\u306e\u3067\u3001\u30eb\u30fc\u30d7\u3092\u7d42\u4e86\u3057\u307e\u3059\u3002)
E1005=activity object can not be found. Make sure the activity object.(\u8a72\u5f53\u306e\u7533\u8acb\u66f8\u306e\u627f\u8a8d\u8005\u3067\u306f\u3042\u308a\u307e\u305b\u3093\u3002\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002)
E1006=application object can not be found. Make sure the application object.\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3002\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002)
E1007=company master can not be found. Make sure the company master(\u4f1a\u793e\u30de\u30b9\u30bf\u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3002\u30de\u30b9\u30bf\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002)
E1008=application form route master can not be found. Make sure the application for route master.(\u7533\u8fbc\u66f8\u5225\u30eb\u30fc\u30c8\u30de\u30b9\u30bf\u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3002\u30de\u30b9\u30bf\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002)
E1009=application classification master can not be found. Make sure the application classification master.(\u7533\u8fbc\u5206\u985e\u30de\u30b9\u30bf\u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3002\u30de\u30b9\u30bf\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002)
E1010=unit master can not be found. Make sure the unit master.(\u90e8\u9580\u30de\u30b9\u30bf\u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3002\u30de\u30b9\u30bf\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002)
E1011=user master can not be found. Make sure the user master.(\u793e\u54e1\u30de\u30b9\u30bf\u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3002\u30de\u30b9\u30bf\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002)
E1012=individual route master can not be found. Make sure the individual route master.(\u500b\u5225\u30eb\u30fc\u30c8\u30de\u30b9\u30bf\u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3002\u30de\u30b9\u30bf\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002)
E1013=boss master can not be found. Make sure the boss master.(\u4e0a\u53f8\u30de\u30b9\u30bf\u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3002\u30de\u30b9\u30bf\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002)
E1014=not a substitute approver. please confirm.(\u4ee3\u7406\u627f\u8a8d\u8005\u3067\u306f\u3042\u308a\u307e\u305b\u3093\u3002\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002)
E1999=\u66f4\u65b0\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002

// \u547c\u3073\u51fa\u3057\u30a8\u30e9\u30fc\u7cfb
E8001=there is a contradiction to the combination of the Acceptor Object and the Visitor Object. please confirm.
